[
    {
        "text": "I-OK na iyan, para may pagkakataong lumaya ang mga taong akala nila magiging masaya sila sa asawa nila nu’ng una, tapos kalaunan may nagbago sa asawa nila, at hindi na masaya. Minsan, mapanakit pa. Paano kung di na masaya si Stella kay Von",
        "date": "2020-02-05T04:54:10.000Z",
        "profileName": "Jason Paul Laxamana",
        "likesCount": "913",
        "label": "neutral"
    },
    {
        "text": "It’s about time… 👏🏻 Make this happen!",
        "date": "2020-02-05T04:34:54.000Z",
        "profileName": "M.A. Buendía",
        "likesCount": "784",
        "label": "neutral"
    },
    {
        "text": "It's about time, Philippines.",
        "date": "2020-02-05T04:39:22.000Z",
        "profileName": "Kristian Reyes",
        "likesCount": "185",
        "label": "anti"
    },
    {
        "text": "Good news for those who are in an abusive and unhappy married! 👍",
        "date": "2020-02-05T04:40:19.000Z",
        "profileName": "Mayvina Murakoshi",
        "likesCount": "387",
        "label": "anti"
    },
    {
        "text": "Some will benefits this, but don't forget this law may be abused as well. Think about the essence of love and family. It should have limits and have proper investigation, if it is proven that the husband/wife or children is abused then it shall be granted.",
        "date": "2020-02-05T05:05:51.000Z",
        "profileName": "David Joshua Diwa Buesa",
        "likesCount": "115",
        "label": "neutral"
    },
    {
        "text": "No problem with this divorce law as long as if a couple has a child or children the law should be more considerate to the welfare of the children /child. Bakit pa kasi magpapakasal if people of this Country wants divorce in the first place. Another law para pagkakitaan mga lawyers and mambabatas. Perfect. 👏😎",
        "date": "2020-02-05T05:22:37.000Z",
        "profileName": "Nyenyeni Momoi Wi",
        "likesCount": "100",
        "label": "anti"
    },
    {
        "text": "why are these legislators wanted to allow this law which will obviously be an anti-family union. Unahin ninyo ng drug problem sa bansa huwag ito.",
        "date": "2020-02-05T05:15:49.000Z",
        "profileName": "Emmanuel Salcedo",
        "likesCount": "106",
        "label": "pro"
    },
    {
        "text": "Nagpapatunay lang  ang batas na to na walang forever :(",
        "date": "2020-02-05T05:06:15.000Z",
        "profileName": "Rowell Divina",
        "likesCount": "252",
        "label": "neutral"
    },
    {
        "text": "Before we rejoice, The last part of this article says, \"However, this measure was rejected by the Senate.\"",
        "date": "2020-02-05T05:05:46.000Z",
        "profileName": "Myra Myrrh Cholet",
        "likesCount": "60",
        "label": "neutral"
    },
    {
        "text": "Theres no such thing as solution fits all. Let it be an option to all. If one wants to stay together in marriage despite being a battered wife, then she has her option to stay. If one wants to end the suffering, let divorce an option. Being against the option is totally different from availing the option or not. So dont impose your experience as basis to be against. There are people and children alike who thinks divorce is the humane way to regain sanity and to make their life intact.",
        "date": "2020-02-05T09:35:16.000Z",
        "profileName": "Jhanus Zed",
        "likesCount": "75"
    },
    {
        "text": "In Pol Sci. There is an article which explains that the family is the basic unit of society. Which is useless. The reason they approved the bill.",
        "date": "2020-02-05T04:39:50.000Z",
        "profileName": "Kathy Kath Kath",
        "likesCount": "60"
    },
    {
        "text": "This is long overdue. Those who still disagree,  may you have a happy married life. But for us who suffered and failed, its our right also to be free from all the pain. Children are smart, they will understand, its not about them, its about the relationship that will never be ok.",
        "date": "2020-02-05T08:45:52.000Z",
        "profileName": "Jannet Baldevarona",
        "likesCount": "44",
        "label": "neutral"
    },
    {
        "text": "It's will be used as an opt out to a commitment. Why? Because you can do it now.. It's legal now. It is easier that mending a broken relationship. Our morals have fallen. A sad day for our country. Our country who values family as a the basic unit of the society.",
        "date": "2020-02-05T04:55:25.000Z",
        "profileName": "Leo Angelo Montalvo",
        "likesCount": "48"
    },
    {
        "text": "This will strengthen marriage life for those who deserve to stay married. Marriage is a privilege to those who respect its vows and fight its trials.",
        "date": "2020-02-05T05:21:25.000Z",
        "profileName": "Carlo Antonio B. Almirante",
        "likesCount": "39"
    },
    {
        "text": "Yes to divorce..for mothers left behind with out financial support from exhusband...this time there are lots of broken families..divorce helps to solve it.",
        "date": "2020-02-05T05:41:03.000Z",
        "profileName": "Jeannette Larena",
        "likesCount": "33"
    },
    {
        "text": "Finally! How much cost to file process  a devorce",
        "date": "2020-02-05T04:46:55.000Z",
        "profileName": "Dojit Tijod",
        "likesCount": "34"
    },
    {
        "text": "It's not religion or society who will dictate your mental, emotional, psychological, physical and financial health. The law protects everyone. If your marriage is fine, well and good. Wag manghimasok sa legal issue ng iba. Let there be divorce law!",
        "date": "2020-02-05T07:34:18.000Z",
        "profileName": "Donna Kat Nalagon Faunal",
        "likesCount": "40",
        "label": "neutral"
    },
    {
        "text": "lalong lalakas loob ng mga mahilig magloko. 😂",
        "date": "2020-02-05T04:40:08.000Z",
        "profileName": "Lovely Villegas",
        "likesCount": "28"
    },
    {
        "text": "Yes to divorce. Kung gusto nyo magpabugbog habang buhay kayo na lang!!! Wag nyo kami idamay sa pagiging martir nyo! May guidelines yan para di maabuso and for sure gagastos din dyan ng malaki parang sa annulment, either way at least merong option.",
        "date": "2020-02-05T05:03:09.000Z",
        "profileName": "Sbguardian Dang",
        "likesCount": "29"
    },
    {
        "text": "A broken family will still be a broken family with or without this law. Just give a chance for others to start fresh and protect the rights of the children.",
        "date": "2020-02-05T06:38:45.000Z",
        "profileName": "Lawrence Bacosa",
        "likesCount": "28"
    },
    {
        "text": "Kasama sa kasal at sa pag-aasawa yung sumpaan na “Kamatayan lang Ang makakapaghiwalay sa pinagsama ng Diyos.” Kung gusto niyo pala ng Diborsyo eh magpakasal kayo sa isang relihiyon na may sumpaan na “Hanggang sa papaghiwalayin Tayo ng HinDi Natin Pagkakasundo” Yan Ang uso diba,  Pinagsama ng Diyos, Pinaghiwalay ng Tao.",
        "date": "2020-02-05T05:08:03.000Z",
        "profileName": "Bunicnic Danica Marc",
        "likesCount": "27"
    },
    {
        "text": "Thank you so much. So happy for this news. Yes to Divorce!",
        "date": "2020-02-05T04:47:36.000Z",
        "profileName": "Erly Elim",
        "likesCount": "69"
    },
    {
        "text": "Kaya tayo pinaparusahan ng langit.. hayzzzz 😩😩",
        "date": "2020-02-05T04:40:02.000Z",
        "profileName": "Arabella Deborah Ramos",
        "likesCount": "66"
    },
    {
        "text": "Think about it.. When this becomes ok to do, it means it’s ok to inflict pain on the children as well. No matter how you slice the cake, it’s the kids who always suffer from any family break up. Strengthening the family and couple union makes more sense as a first resort, before even thinking of a separation. #theValueOfFamily",
        "date": "2020-02-05T04:52:01.000Z",
        "profileName": "Rosanna C. Escudero",
        "likesCount": "2K"
    },
    {
        "text": "Oo nga naman kesa pinagkakaperahan lang nga mga abogado dito sa pinas yan  pocha",
        "date": "2020-02-05T04:38:44.000Z",
        "profileName": "Whey Hello",
        "likesCount": "23"
    },
    {
        "text": "If relationship went sour , then why stay ? Go and get divorce and be free from any stress .",
        "date": "2020-02-05T04:54:51.000Z",
        "profileName": "Elna Catlin",
        "likesCount": "19"
    },
    {
        "text": "Everything goes back to finding the right partner... Damn if only it was as stringent as a job application we would have no abusive partners and  more mature family builders... Alas that emotions should mask people's logic",
        "date": "2020-02-05T05:19:26.000Z",
        "profileName": "Cha Jardeleza",
        "likesCount": "21"
    },
    {
        "text": "Probably better especially for battered wife...nd husband but i think before marrying think of it 1thousand times for it was a lifetime commitment...",
        "date": "2020-02-05T04:54:55.000Z",
        "profileName": "Inoses Gandacious Oidotsuc",
        "likesCount": "17"
    },
    {
        "text": "Good move. While it may be beneficial to patch up relationships, the state should offer the option to terminate a union if it no longer is healthy and beneficial for all parties involved.",
        "date": "2020-02-05T04:57:07.000Z",
        "profileName": "Frederick Cacnio",
        "likesCount": "15"
    },
    {
        "text": "Some of you will never know the pain brought by a broken family. The sacrifices an eldest daughter would do just to fill the gap. I grew up thinking na baka hindi kami enough ng mga kapatid ko, or baka we're a mistake. And don't ever say to me na iniisip ko lang 'to. Unless you know it, unless you felt it, unless you've undergone the process of telling yourself over and over again na kakayanin mo. Mas maganda siguro na before entering marriage, one should be stable in all aspects, hindi nagpapadala sa biglang taas-baba lang ng hormones at pabago-bagong emotions",
        "date": "2020-02-05T05:18:34.000Z",
        "profileName": "Yhin Layaban",
        "likesCount": "564"
    },
    {
        "text": "2 paraphrase Unamuno, d great thinker, 4 d House 2 finally prevail with d divorce law, they must convince; 2 convince, they must persuade; & in order 2 persuade, they need what they do not & cannot have:  Right & reason in d crucial struggle.",
        "date": "2020-02-05T04:40:42.000Z",
        "profileName": "Crisanto Dantes",
        "likesCount": "13"
    },
    {
        "text": "Nasa presidente parin ang huling desisyon.. kung i-veveto o i-aapproved. Sabi ni PRRD. Against sya sa Divorce Law nung kampanya palang at sinabi din ni PRRD nung Presidential Debates 2016",
        "date": "2020-02-05T04:44:45.000Z",
        "profileName": "Dheo Penaranda",
        "likesCount": "11"
    },
    {
        "text": "Think also those  women that suffer  from pain! Go for it!",
        "date": "2020-02-05T05:26:29.000Z",
        "profileName": "Riza Isaac",
        "likesCount": "12"
    },
    {
        "text": "Wow...the philippines is getting to be high civilized society....love it.",
        "date": "2020-02-05T07:01:20.000Z",
        "profileName": "Xialen Lee",
        "likesCount": "9"
    },
    {
        "text": "Wow sana totoo na at maibalik ko ung apelyido ko..being a soloparent ang hirap at unfair para sakin na mag isa akong tumatayo sa responsibilidad para sa mga anak..ngayon if totoo man ito this is it..",
        "date": "2020-02-05T04:48:32.000Z",
        "profileName": "Muriera Marie Cris",
        "likesCount": "10"
    },
    {
        "text": "Sana ang ground lng nito is yung abusive partner.. not healthy couple na pati kids nadadamay na. It should not be applicable to all na gusto lng maghiwalay without valid reason. ... 💔",
        "date": "2020-02-05T05:10:46.000Z",
        "profileName": "Cerol Tugnao",
        "likesCount": "12"
    },
    {
        "text": "Next up on the agenda, SAME-SEX UNION, please. Ayan ah, I specifically used the word UNION and not marriage to avoid hurting the delicate sensibilities of other people. 😏",
        "date": "2020-02-05T05:03:39.000Z",
        "profileName": "Kristian Reyes",
        "likesCount": "422"
    },
    {
        "text": "i think we should make it a little bit more complex. para naman we respect the religions belief na only God can separate what he has made into one. so maybe we give choices to people. civil wedding which may kasamang divorce sa contract if needed. and church wedding which is for life. kasi if you value religion you put God's words first before anything else. and also the bible teaches us to respect's man's own laws.",
        "date": "2020-02-05T04:43:28.000Z",
        "profileName": "Andrew James Francisco",
        "likesCount": "220"
    },
    {
        "text": "Iyak Catholic Church nyan. Ang religious leaders na hindi pabor sa divorce pero mga wala naman asawa.",
        "date": "2020-02-05T04:48:50.000Z",
        "profileName": "Ric Gdy",
        "likesCount": "9"
    },
    {
        "text": "tulfo o divorce heheheh manood kasi ng tulfo yung mga christyano dyang saradong ang pagiisip",
        "date": "2020-02-05T04:41:14.000Z",
        "profileName": "Luke Ge",
        "likesCount": "10"
    },
    {
        "text": "Good move. Because everyones deserve to be happy to start all over again.",
        "date": "2020-02-05T04:40:30.000Z",
        "profileName": "Khelo Lopez Tico",
        "likesCount": "169"
    },
    {
        "text": "Hoping to have Divorce bill in the Philippines",
        "date": "2020-02-05T05:46:44.000Z",
        "profileName": "Dai Avon",
        "likesCount": "5"
    },
    {
        "text": "Time to move forward. We're the only country left out. Think about those being abused physically, emotionally and verbally. Parenting does not stop when parents move on their separate ways. It's much healthier than seeing their parents fight every single day",
        "date": "2020-02-05T05:04:34.000Z",
        "profileName": "Kirby Drice",
        "likesCount": "119"
    },
    {
        "text": "Yes to divorce! State must always be separate from the Church.",
        "date": "2020-02-05T04:57:49.000Z",
        "profileName": "Maik Salomon",
        "likesCount": "108"
    },
    {
        "text": "If passed in bicam and approved into law, expect marriage as a mere piece of paper for many and a testing ground for compatability. Its sacredness will be tainted and the commitment will always be doubted. Perseverance of couple and preservation of the sanctity will loosen its tensile strength. If the issue is the tedious process of annulment, it has its valid reasons. When two persons engaged in the Sacrament of Marriage, it is understood that it is sacred and perpetual. But if the reason not taking the process of annulment is due to its financial cost, then the law must be amended and lower the bill. The requisites and merits for considerstion must remain.",
        "date": "2020-02-05T05:48:34.000Z",
        "profileName": "Cyrus Jose Urbano",
        "likesCount": "100"
    },
    {
        "text": "For a marriage binded only by papers.. For a wife who has been cheated on countless times.. For a mother who solely sacrificed for her kids.. For the kids to finally see their mom be free from all of the pain and lies.. PLEASE PASS THIS DIVORCE LAW..",
        "date": "2020-02-05T05:19:32.000Z",
        "profileName": "April Fontanos",
        "likesCount": "96"
    },
    {
        "text": "Abused wives and husbands need this to start over and heal. The Mental health and security of an individual should be prioritized more than anything, especially over this so-called “keep the family intact” misconception.",
        "date": "2020-02-05T05:01:46.000Z",
        "profileName": "KC SJ",
        "likesCount": "91"
    },
    {
        "text": "Even without divorce law if the two parties cannot be of good faith due to pain inflicted them, children still in pain and the worst if they -mother and father - will be forced to live in one roof, both of them will not be at peace , it seems being  together already a punishment. That is why divorce was a legal solution due to the fact that we already had the legal separation, which was most likely, a lighter replica of divorce which is not a total breaking up of legal documents as husband and wife.\n",
        "date": "2020-02-05T10:54:13.000Z",
        "profileName": "Sultan Karem Majeed",
        "likesCount": "4"
    },
    {
        "text": "Why force couples to be together when love and respect no longer exist . How can you live with someone you don’t love  anymore . One party always suffers silently just to keep the family together . And if they are in the same house they dont talk to each other . Children should also not see their parent  suffering from verbal and physical abuse . If this is the case it is better they live apart .",
        "date": "2020-02-05T05:25:21.000Z",
        "profileName": "Gina Naughton",
        "likesCount": "86"
    },
    {
        "text": "Siyempre sila unang makikinabang diyan e sa dami nilang chicks. Goodbye na sa matatandang misis.. Hello fresh girls lapit na kay Kong! ",
        "date": "2020-02-05T04:39:52.000Z",
        "profileName": "Andrew Mark Degrano",
        "likesCount": "28"
    }
]